balazsplaszkony/Obstacle-Avoiding-Car/LPC845_Project/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v13.0
processor: LPC845
package_id: LPC845M301JBD48
mcu_data: ksdk2_0
processor_version: 13.0.1
board: LPC845BREAKOUT
external_user_signals: {}
pin_labels:
- {pin_num: '2', pin_signal: PIO0_13/ADC_10, label: 'CN1[26]/PIO0_13/ADC_10', identifier: UltraSonicTrig}
- {pin_num: '7', pin_signal: PIO0_28/WKTCLKIN, label: 'CN1[14]/PIO0_28/WKTCLKIN', identifier: Servo}
- {pin_num: '12', pin_signal: PIO0_11/I2C0_SDA, label: 'CN1[24]/PIO0_11/I2C0_SDA', identifier: Encoder;Encoder2;Encoder1}
- {pin_num: '13', pin_signal: PIO0_10/I2C0_SCL, label: 'CN1[23]/PIO0_10/I2C0_SCL', identifier: Motor1IN2;Motor2IN2}
- {pin_num: '15', pin_signal: PIO0_16, label: 'CN1[1]/PIO0_16', identifier: Motor2PWM;Motor1PWM;Motor1EN}
- {pin_num: '17', pin_signal: PIO0_27, label: 'CN1[13]/PIO0_27', identifier: Bluetooth_Tx}
- {pin_num: '18', pin_signal: PIO0_26, label: 'CN1[12]/PIO0_26', identifier: Bluetooth_Rx}
- {pin_num: '22', pin_signal: PIO0_15, label: 'CN1[28]/PIO0_15', identifier: HC05_Rising;Hc05_Falling;Ultrasonic_Rising;Ultrasonic_Falling;Ultrasonic_Echo;UltraSonicEcho}
- {pin_num: '25', pin_signal: PIO0_9/XTALOUT, label: 'CN1[18]/CN1[22]/PIO0_9/XTALOUT', identifier: Motor2PWM;Motor2EN}
- {pin_num: '26', pin_signal: PIO0_8/XTALIN, label: 'CN1[19]/CN1[21]/PIO0_8/XTALIN', identifier: Motor2Dir;Motor2IN1}
- {pin_num: '33', pin_signal: PIO0_7/ADC_0, label: 'CN1[32]/RV1/PIO0_7/ADC_0', identifier: OpticSensor1;OpticSensor0;potmeter}
- {pin_num: '34', pin_signal: PIO0_6/ADC_1/ACMPVREF, label: 'CN1[33]/PIO0_6/ADC_1/ACMPVREF', identifier: OpticSensor1;OpticSensor0}
- {pin_num: '36', pin_signal: PIO0_0/ACMP_I1, label: 'CN1[39]/PIO0_0/ACMP_I1/TDO', identifier: IR_LED_EN}
- {pin_num: '37', pin_signal: PIO0_14/ACMP_I3/ADC_2, label: 'CN1[27]/PIO0_14/ACMP_I3/ADC_2', identifier: UltraSonicTrig;OpticSensor3;OpticSensor2;OpticSensor1}
- {pin_num: '38', pin_signal: PIO0_29/DACOUT_1, label: 'CN1[15]/PIO0_29/DACOUT_1', identifier: Encoder1}
- {pin_num: '39', pin_signal: PIO0_23/ADC_3/ACMP_I4, label: 'CN1[8]/PIO0_23/ADC_3/ACMP_I4', identifier: OpticSensor3;OpticSensor2}
- {pin_num: '43', pin_signal: PIO0_22/ADC_4, label: 'CN1[7]/PIO0_22/ADC_4', identifier: Encoder2}
- {pin_num: '44', pin_signal: PIO0_21/ADC_5, label: 'CN1[6]/PIO0_21/ADC_5', identifier: OpticSensor3}
- {pin_num: '47', pin_signal: PIO0_18/ADC_8, label: 'CN1[3]/PIO0_18/ADC_8', identifier: Motor1IN3;Motor1IN2}
- {pin_num: '48', pin_signal: PIO0_17/ADC_9/DACOUT_0, label: 'CN1[2]/PIO0_17/ADC_9/DACOUT_0', identifier: Motor1Dir;Motor1IN1}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

#include "fsl_common.h"
#include "fsl_gpio.h"
#include "fsl_iocon.h"
#include "fsl_swm.h"
#include "pin_mux.h"

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitLEDsPins();
    BOARD_InitDEBUG_UARTPins();
    BOARD_InitSWD_DEBUGPins();
    BOARD_InitBUTTONsPins();
    BOARD_InitCAPTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '18', peripheral: USART1, signal: RXD, pin_signal: PIO0_26}
  - {pin_num: '17', peripheral: USART1, signal: TXD, pin_signal: PIO0_27}
  - {pin_num: '22', peripheral: CTIMER0, signal: 'CAPTURE, 0', pin_signal: PIO0_15, identifier: UltraSonicEcho}
  - {pin_num: '33', peripheral: ADC0, signal: 'CH, 0', pin_signal: PIO0_7/ADC_0, identifier: potmeter}
  - {pin_num: '34', peripheral: ADC0, signal: 'CH, 1', pin_signal: PIO0_6/ADC_1/ACMPVREF, identifier: OpticSensor0}
  - {pin_num: '37', peripheral: ADC0, signal: 'CH, 2', pin_signal: PIO0_14/ACMP_I3/ADC_2, identifier: OpticSensor1}
  - {pin_num: '39', peripheral: ADC0, signal: 'CH, 3', pin_signal: PIO0_23/ADC_3/ACMP_I4, identifier: OpticSensor2}
  - {pin_num: '2', peripheral: GPIO, signal: 'PIO0, 13', pin_signal: PIO0_13/ADC_10, direction: OUTPUT}
  - {pin_num: '15', peripheral: SCT0, signal: 'OUT, 0', pin_signal: PIO0_16, identifier: Motor1EN}
  - {pin_num: '25', peripheral: SCT0, signal: 'OUT, 1', pin_signal: PIO0_9/XTALOUT, identifier: Motor2EN}
  - {pin_num: '48', peripheral: GPIO, signal: 'PIO0, 17', pin_signal: PIO0_17/ADC_9/DACOUT_0, identifier: Motor1IN1, direction: OUTPUT}
  - {pin_num: '47', peripheral: GPIO, signal: 'PIO0, 18', pin_signal: PIO0_18/ADC_8, identifier: Motor1IN2, direction: OUTPUT}
  - {pin_num: '26', peripheral: GPIO, signal: 'PIO0, 8', pin_signal: PIO0_8/XTALIN, identifier: Motor2IN1, direction: OUTPUT}
  - {pin_num: '13', peripheral: GPIO, signal: 'PIO0, 10', pin_signal: PIO0_10/I2C0_SCL, identifier: Motor2IN2, direction: OUTPUT}
  - {pin_num: '12', peripheral: CTIMER0, signal: 'CAPTURE, 1', pin_signal: PIO0_11/I2C0_SDA, identifier: Encoder1}
  - {pin_num: '43', peripheral: CTIMER0, signal: 'CAPTURE, 2', pin_signal: PIO0_22/ADC_4}
  - {pin_num: '44', peripheral: ADC0, signal: 'CH, 5', pin_signal: PIO0_21/ADC_5, mode: pullUp}
  - {pin_num: '36', peripheral: GPIO, signal: 'PIO0, 0', pin_signal: PIO0_0/ACMP_I1, direction: OUTPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

